Repository: rmraya/Fluenta
Catalog: i18n/fluenta_es.ditamap.tmx
Source language: en
Languages: es

source: On Linux the default location for the shell script is /opt/Maxprograms/Fluenta/fluenta_cli.sh
es: En Linux la ubicación predeterminada del script es /opt/Maxprograms/Fluenta/fluenta_cli.sh

source: Fluenta needs to know two things for working with XML files:
es: Fluenta necesita saber dos cosas para trabajar con archivos XML:

source: How to locate the grammar rules and entities declared in an XML file, if any.
es: Cómo localizar las reglas gramaticales y las entidades declaradas en un archivo XML, si las hay.

source: What elements and attributes contain translatable text.
es: Qué elementos y atributos contienen texto traducible.

source: XML catalogs that follow the specification published at https://www.oasis-open.org/committees/entity/spec-2001-08-06.html by OASIS are used to resolve the location of XML DTDs and Schemas.
es: Se utilizan catálogos XML según la especificación publicada por OASIS en https://www.oasis-open.org/committees/entity/spec-2001-08-06.html para resolver la ubicación de archivos DTD y XML Schema.

source: Special XML files are used to configure the elements and attributes that contain translatable text. These files are used by the internal XML filter to extract text for processing. The configuration files are created and maintained using the application's graphical user interface.
es: Se utilizan archivos XML especiales para configurar los elementos y atributos que contienen texto traducible. Estos archivos son utilizados por el filtro XML interno para extraer texto para su procesamiento. Los archivos de configuración se crean y mantienen mediante la interfaz gráfica de usuario de la aplicación.

source: The following picture shows the XML Options tab of the Preferences dialog:
es: La siguiente imagen muestra la pestaña Opciones XML del cuadro de diálogo Preferencias :

source: On Windows use fluenta_cli.bat (available in the default installation directory) to process command line parameters.
es: En Windows utilice fluenta_cli.bat (disponible en la carpeta predeterminada de instalación) para procesar los parámetros de la línea de comandos.

source: JavaScript Object Notation (JSON) is an open standard for the serialization of structured data in text format . It is derived from the object literals of JavaScript, as defined in the ECMAScript Programming Language Standard, Third Edition. JSON specification is available at https://tools.ietf.org/html/rfc7159 .
es: JavaScript Object Notation (JSON) es un estándar abierto para la serialización de datos estructurados en formato de texto . Se deriva de los literales de objeto de JavaScript, tal y como se definen en el Estándar del Lenguaje de Programación ECMAScript, Tercera Edición. La especificación JSON está disponible en https://tools.ietf.org/html/rfc7159 .

source: Language Service Provider (LSP)
es: Proveedor de Servicios Lingüísticos (PSL)

source: A company or individual specialized in providing translation and localization services.
es: Una empresa o individuo especializado en proporcionar servicios de traducción y localización.

source: OASIS ( Organization for the Advancement of Structured Information Standards ) is a not-for-profit consortium that drives the development, convergence and adoption of open standards for the global information society.
es: OASIS ( Organization for the Advancement of Structured Information Standards ) es un consorcio sin fines de lucro que impulsa el desarrollo, la convergencia y la adopción de normas abiertas para la sociedad global de la información.

source: Segmentation Rules eXchange (SRX) is an XML-based open standard, originally published by LISA (Localization Industry Standards Association), for describing how translation and other language-processing tools segment text for processing.
es: Segmentation Rules eXchange (SRX) es un estándar abierto basado en XML, publicado por LISA (Localization Industry Standards Association), para describir cómo las herramientas de traducción y de procesamiento de idiomas segmentan el texto para su procesamiento.

source: Translation Memory eXchange (TMX) is an open standard originally published by LISA (Localization Industry Standards Association). The purpose of TMX is to allow easier exchange of translation memory data between tools and/or translation vendors with little or no loss of critical data during the process.
es: Translation Memory eXchange (TMX) es un estándar abierto publicado originalmente por LISA (Localization Industry Standards Association). El propósito de TMX es permitir un intercambio más fácil de datos de memorias de traducción entre herramientas y/o proveedores de traducción con poca o ninguna pérdida de datos críticos durante el proceso.

source: Configuration Files
es: Archivos de Configuración

source: XLIFF (XML Localization Interchange File Format) is an open standard developed by OASIS (Organization for the Advancement of Structured Information Standards). The purpose of this vocabulary is to store localizable data and carry it from one step of the localization process to the other, while allowing interoperability between tools.
es: XLIFF (XML Localization Interchange File Format) es un estándar abierto desarrollado por OASIS (Organization for the Advancement of Structured Information Standards). El propósito de este vocabulario es almacenar datos localizables y llevarlos de un paso del proceso de localización a otro, al tiempo que permite la interoperabilidad entre herramientas.

source: Translation Memory
es: Memoria de Traducción

source: Create Project
es: Crear Proyecto

source: Generate XLIFF
es: Generar XLIFF

source: Send XLIFF Out for Translation
es: Enviar XLIFF para Traducción

source: Import Translated XLIFF
es: Importar XLIFF Traducido

source: Update DITA Content
es: Actualizar Contenido DITA

source: Publish Translated DITA
es: Publicar DITA Traducido

source: Add Configuration File
es: Añadir Archivo de Configuración

source: Fluenta includes a configuration file for the 600+ elements defined defined in Appendix B.6 of DITA 1.3 All-Inclusive Edition .
es: Fluenta incluye un archivo de configuración para los más de 600 elementos definidos en el Apéndice B.6 de DITA 1.3 All-Inclusive Edition .

source: In XML Options tab of the Preferences dialog, click the Add Configuration File button.
es: En la pestaña Opciones XML del cuadro de diálogo Preferencias , haga cic en el botón Añadir Archivo de Configuración .

source: The following dialog appears:
es: El siguiente cuadro de diálogo aparece:

source: Add Configuration File dialog
es: Cuadro de diálogo Añadir Archivo de Configuración

source: Type the name of the root element of your XML files in the Root Element text box. The name of the root element is used to name the configuration file.
es: Escriba el nombre del elemento raíz de sus archivos XML en el cuadro de texto Elemento Raíz . El nombre del elemento raíz se utiliza para nombrar el archivo de configuración.

source: Click the Add Configuration File button.
es: Haga clic en el botón Añadir Archivo de Configuración .

source: Grammar Configuration dialog
es: Cuadro de diálogo Configuración de Grámatica

source: Click the Add Element button to add the configuration of an element.
es: Haga clic en el botón Añadir Elemento para añadir la configuración de un elemento.

source: Element Configuration dialog
es: Cuadro de diálogo Configuración de Elemento

source: Start by creating a project . All you have to do is provide the location of your DITA map and select the languages that you want to translate into.
es: Empiece por crear un proyecto . Todo lo que tiene que hacer es proporcionar la ubicación de su mapa DITA y seleccionar los idiomas a los que desea traducir.

source: A configuration file for Scalable Vector Graphics (SVG) is also shipped in fluenta installers.
es: Los instaladores de Fluenta también incluyen un archivo de configuración para Scalable Vector Graphics (SVG).

source: Type the name of the element being added in the Element Name text box.
es: Escriba el nombre del elemento a añadir en el cuadro de texto Nombre del Elemento .

source: Select the type of element in the Element Type drop-down list. Available types are:
es: Seleccione el tipo de elemento en la lista desplegable Tipo de Elemento . Los tipos disponibles son:

source: segment : the selected element starts a new section of translatable text.
es: segment : el elemento seleccionado inicia una nueva sección de texto traducible.

source: inline : the selected element represents a change in formatting options and does not start a new section of translatable text.
es: inline : el elemento seleccionado representa un cambio en las opciones de formato y no inicia una nueva sección de texto traducible.

source: ignore : the selected element and its children should be ignored.
es: ignore : el elemento seleccionado y sus descendientes deben ignorarse.

source: If the element type is "inline", select the kind of formatting represented by the element in the Inline Type drop-down list.
es: Si el tipo de elemento es "inline", seleccione el tipo de formato que ele elemento representa en la lista desplegable Tipo de Formato .

source: If the element has translatable attributes, enter their names separated by a ";" in the Translatable Attributes text box.
es: Si el elemento tiene atributos traducibles, introduzca sus nombres separados por un ";" en el cuadro de texto Atributos Traducibles .

source: If white space needs to be preserved when extracting text, select "Yes" in the Keep White Space drop-down list.
es: Si es necesario conservar los espacios en blanco al extraer el texto, seleccione "Yes" en la lista desplegable Preservar Espacios .

source: Click the Save Configuration button.
es: Haga clic en el botón Guardar Configuración .

source: Repeat the previous steps until all required elements have been configured.
es: Repita los pasos anteriores hasta haber configurado todos los elementos necesarios.

source: Additional configurations can be added by the user as required.
es: El usuario puede añadir configuraciones adicionales según sus necesidades.

source: A new configuration file for the XML filter is created.
es: Un nuevo archivo de configuración para el filtro de XML es creado.

source: Create Memory
es: Crear Memoria

source: Follow these steps to create a new translation memory.
es: Siga estos pasos para crear una nueva memoria de traducción.

source: In main menu, select Memories Create Memory or click the Create Memory Create Memory button in Memories view toolbar.
es: En el menú principal, seleccione Memorias Crear Memoria o haga clic en el botón Crear Memoria Crear Memoria de la barra de herramientas de la vista Memorias .

source: Create Memory dialog
es: Cuadro de diálogo Crear Memoria

source: Type a name for the new memory in the Memory Name text box.
es: Ingrese un nombre para la nueva memoria en el cuadro de texto Nombre de la Memoria .

source: Select the source language for the new memory in the Source Language drop-down list.
es: Seleccione el idioma origen para la nueva memoria de la lista desplegable Idioma Origen .

source: Optionally, enter a description in the Memory Description text box.
es: Si lo desea, introduzca una descripción en el cuadro de texto Descripción de la memoria .

source: Click the Create Memory button.
es: Haga clic en el botón Crear Memoria .

source: A new memory is created and the list of memories in the Memories view is updated to reflect the changes.
es: Se crea una nueva memoria y la lista de memorias de la vista Memorias se actualiza para reflejar los cambios.

source: Follow these steps to create a translation project from your DITA map.
es: Siga estos pasos para crear un proyecto de traducción a partir de su mapa DITA.

source: In main menu, select Projects Create Project or click the Create Project Create Project button in Projects view toolbar.
es: En el menú principal, seleccione Proyectos Crear Proyecto o haga clic en el botón Crear Proyecto Crear Proyecto de la barra de herramientas de la vista Proyectos .

source: Create Project dialog
es: Cuadro de diálogo Crear Proyecto

source: Type the name of the DITA map in the DITA Map text box or use the Browse... button to select a DITA map from the file system.
es: Escriba el nombre del mapa DITA en el cuadro de texto Mapa DITA o utilice el botón Examinar... para seleccionar un mapa DITA del sistema de archivos.

source: Type a project name in the Project Name text box.
es: Ingrese un nombre para el proyecto en el cuadro de texto Nombre del Proyecto .

source: Optionally, enter a description for the project in the Project Description text box.
es: Si lo desea, introduzca una descripción en el cuadro de texto Descripción del Proyecto .

source: Add additional target languages to the default set if required.
es: Añada nuevos idiomas destino al conjunto predeterminado de ser necesario.

source: Use the following parameters to create a memory from command line:
es: Utilice los siguientes parámetros para crear una memoria desde la línea de comandos:

source: Click Add Target Language button.
es: Haga clic en el botón Añadir Idioma Destino .

source: Selected language is added to the project and the dialog is closed.
es: El idioma seleccionado se añade al proyecto y se cierra el cuadro de diálogo.

source: Remove unnecessary languages from the default language set if required.
es: Si es necesario, elimine del conjunto de idiomas predeterminado aquellos que no vaya a utilizar.

source: Associate additional memories with the new project if required.
es: Si es necesario, asocie memorias adicionales al nuevo proyecto.

source: Click on the Memories tab.
es: Haga clic en la pestaña Memorias .

source: The Memories tab opens and the Create Project dialog changes to:
es: La pestaña Memorias se abre y el cuadro de diálogo Crear Proyecto cambia a:

source: Create Project dialog, Memories view
es: Cuadro de diálogo Crear Proyecto , vista de Memorias

source: Click the Associate Other Memories button.
es: Haga clic en el botón Asociar Otras Memorias .

source: Additional Memories dialog
es: Cuadro de diálogo Memorias Adicionales

source: Select the check boxes next to the memories that you want to associate with the new project.
es: Seleccione las casillas de verificación situadas junto a las memorias que desea asociar al nuevo proyecto.

source: Click the Add Selected Memories button.
es: Haga clic en el botón Añadir Memorias Seleccionadas .

source: Selected memories are associated with the new project and the dialog closes.
es: Las memorias seleccionadas se asocian al nuevo proyecto y el cuadro de diálogo se cierra.

source: Click the Create Project button.
es: Haga clic en el botón Crear Proyecto .

source: A new project is created and the list of projects in the Projects view is updated to reflect the changes.
es: Se crea un nuevo proyecto y la lista de proyectos de la vista Proyectos se actualiza para reflejar los cambios.

source: Edit Configuration File
es: Modificar Archivo de Configuración

source: In XML Options tab of the Preferences dialog, select the configuration file to edit.
es: En la pestaña Opciones XML del cuadro de diálogo Preferencias , seleccione el archivo de configuración a modificar.

source: Click the Edit Configuration File button.
es: Haga clic en el botón Modificar Archivo de Configuración .

source: Use the buttons in the Grammar Configuration dialog to update the configuration file.
es: Utilice los botones del cuadro de diálogo Configuración de Gramática para actualizar el archivo de configuración.

source: Use the Add Element button to add a new element to the configuration file.
es: Utilice el botón Añadir Elemento para añadir un nuevo elemento al archivo de configuración.

source: Use the Edit Element button to modify the properties of an existing element.
es: Utilice el botón Modificar Elemento para cambiar las propiedades de un elemento existente.

source: Use the Remove Element button to delete an element from the configuration file.
es: Utilice el botón Eliminar Elemento para eliminar un elemento del archivo de configuración.

source: Repeat the previous step until all elements are properly configured.
es: Repita el paso anterior hasta que todos los elementos estén correctamente configurados.

source: Edit Memory
es: Modificar Memoria

source: Follow these steps to edit the name, source language or description of a translation memory.
es: Siga estos pasos para editar el nombre, el idioma origen o la descripción de una memoria de traducción.

source: In main menu, select Memories Edit Memory or click the Edit Memory Edit Memory button in Memories view toolbar.
es: En el menú principal, seleccione Memorias Modificar Memoria o haga clic en el botón Modificar Memoria Modificar Memoria de la barra de herramientas de la vista Memorias .

source: Edit Memory dialog
es: Cuadro de diálogo Modificar Memoria

source: Edit all fields as required.
es: Modifique todos los campos según sea necesario.

source: Click the Update Memory button.
es: Haga clic en el botón Actualizar Memoria .

source: Selected memory data is updated and the list of memories in the Memories view is updated to reflect the changes.
es: La memoria seleccionada se actualiza y la lista de memorias de la vista Memorias se actualiza para reflejar los cambios.

source: Export Memory as TMX File
es: Exportar Memoria a un Archivo TMX

source: The content of Fluenta memories can be exported in TMX format for exchanging with other tools or for backup purposes.
es: El contenido de las memorias de Fluenta puede exportarse en formato TMX para intercambiarlo con otras herramientas o para realizar copias de seguridad.

source: In Memories view, select the translation memory that you want to export.
es: En la vista de Memorias , seleccione la memoria de traducción que desea exportar.

source: In main menu, select Memories Export TMX File or click the Export TMX File Export TMX File button in the Memories view toolbar
es: En el menú principal, seleccione Memorias Exportar Archivo TMX o haga clic en el botón Exportar Archivo TMX Exportar Archivo TMX de la barra de herramientas en la vista Memorias .

source: In the file selection dialog appears, select a name and location for the TMX file that will contain the memory data.
es: En el cuadro de diálogo de selección de archivos que aparece, seleccione un nombre y una ubicación para el archivo TMX que contendrá los datos de la memoria.

source: Memory data is exported in TMX format in the selected file.
es: Los datos de la memoria son exportados en formato TMX en el archivo seleccionado.

source: Follow these steps to generate XLIFF files that you can send to your Language Service Provider (LSP) for translating your projects.
es: Siga estos pasos para generar archivos XLIFF que podrá enviar a su Proveedor de Servicios Lingüísticos (PSL) para que traduzca sus proyectos.

source: In Projects view, select the project that will be translated.
es: En la vista Proyectos , seleccione el proyecto a traducir.

source: In main menu, select Projects Generate XLIFF or click the Generate XLIFF Generate XLIFF button in the Projects view toolbar.
es: En el menú principal, seleccione Proyectos Crear Proyecto o haga clic en el botón Crear Proyecto Crear Proyecto de la barra de herramientas de la vista Proyectos .

source: Generate XLIFF dialog
es: Cuadro de diálogo Generar XLIFF

source: Type the name of the folder where the XLIFF files should be placed in the XLIFF Folder text box or use the Browse... button to select a folder in the file system.
es: Escriba el nombre de la carpeta donde deben generarse los archivos XLIFF en el cuadro de texto Carpeta XLIFF o utilice el botón Examinar... para seleccionar una carpeta en el sistema de archivos.

source: If you need to exclude some topics, enter the name of a DITAVAL file that you want to use for conditional processing in the DITAVAL File text box or use the Browse... button next to it to select a file from the file system.
es: Si necesita excluir algunos tópicos, introduzca el nombre de un archivo DITAVAL que desee utilizar para el procesamiento condicional en el cuadro de texto Archivo DITAVAL o utilice el botón Examinar... situado junto a él para seleccionar un archivo del sistema de archivos.

source: Select the Reuse ICE Matches check box if you want to compare current content with the content available last time an XLIFF file was generated and reuse all existing translations.
es: Seleccione la casilla Reutilizar coincidencias ICE si desea comparar el contenido actual con el contenido disponible la última vez que se generó un archivo XLIFF y reutilizar todas las traducciones existentes.

source: Select the Modified Files Only check box to exclude from the generated XLIFF files those topics that have not changed since the last translation cycle.
es: Seleccione la casilla Sólo archivos modificados para excluir de los archivos XLIFF generados aquellos temas que no hayan cambiado desde el último ciclo de traducción.

source: Select the Use Translation Memories check box if you want to recover translations for untranslated segments using the memories associated with the project.
es: Seleccione la casilla Usar memorias de traducción si desea recuperar las traducciones de los segmentos no traducidos utilizando las memorias asociadas al proyecto.

source: Select the Paragraph Segmentation check box if you need paragraph instead of sentence segmentation (default).
es: Seleccione la casilla Segmentar por párrafos si necesita segmentar por párrafos en lugar de oraciones (opción predeterminada).

source: One advantage of paragraph segmentation over sentence segmentation in translation is that it can capture more context and coherence within a text unit
es: Una de las ventajas de la segmentación por párrafos frente a la segmentación por oraciones en traducción es que permite captar más contexto y coherencia dentro de una unidad textual.

source: Select the Generate Word Count check box if you want a statistic analysis to be generated for each target language.
es: Seleccione la casilla Generar estadísticas si desea que se genere un análisis estadístico para cada idioma de destino.

source: Select the Generate XLIFF 2.0 check box if you need to generate XLIFF 2.0 instead of XLIFF 1.2 (default).
es: Seleccione la casilla Generar XLIFF 2.0 si necesita generar XLIFF 2.0 en lugar de XLIFF 1.2 (opción predeterminada).

source: Select the Ignore Tracked Changes check box to ignore tracked changes from Oxygen XML Editor, improving text segmentation.
es: Seleccione la casilla Ignorar revisiones para ignorar las revisiones del Editor XML Oxygen, mejorando la segmentación del texto.

source: A JSON file containing the data required for creating the memory
es: Un archivo JSON que contiene los datos necesarios para crear la memoria

source: Select the Embed Skeleton checkbox if you need XLIFF files that can be converted back to DITA in any computer using OpenXLIFF Filters or XLIFF Manager .
es: Seleccione la casilla Incrustar esqueleto si necesita archivos XLIFF que puedan convertirse de nuevo a DITA en cualquier ordenador utilizando OpenXLIFF Filters o XLIFF Manager .

source: Select the check boxes corresponding to the target languages that you want to process.
es: Seleccione las casillas correspondientes a los idiomas destino que desea procesar.

source: Click the Generate XLIFF button.
es: Haga clic en el botón Generar XLIFF .

source: Generation status is displayed in the progress panel and the Cancel button is enabled.
es: El estado del proceso se muestra en el panel de progreso y se activa el botón Cancelar .
